import TelegramBot from "node-telegram-bot-api";
import type { Message } from "node-telegram-bot-api";

export default async function onHelp(bot: TelegramBot, msg: Message) {
  const helpMsg = `
📚 **Справочник команд Okimi-Chan**

**/user ник\\_игрока** — показать статистическую карточку любого игрока: *pp, глобальный рейтинг, accuracy, общий скор* и др.  

**/link ник\\_игрока** — привязать ваш Telegram-аккаунт к конкретному osu!-нику, чтобы использовать команду \`/me\`.  

**/me** — быстрый просмотр статистики профиля, привязанного к вашему Telegram-аккаунту.  

**/unlink** — удалить текущую привязку osu!-профиля от вашего Telegram-аккаунта.  
`;

  await bot.sendMessage(msg.chat.id, helpMsg, { parse_mode: "Markdown" });
}
