import TelegramBot from "node-telegram-bot-api";
import type { Message } from "node-telegram-bot-api";

export default async function onStart(bot: TelegramBot, msg: Message) {
  const startMsg = `
*📊 Добро пожаловать в Okimi-Chan — вашего помощника для работы со статистикой osu!*

🗓 Наш бот получает актуальные данные через API и создает карточки профилей в виде изображения. Теперь делиться своими достижениями стало еще проще.

*Основные функции:*
📈 *Просмотр статистики:* Используйте /user ник\\_игрока
🔗 *Привязка аккаунта:* Команда /link ник\\_игрока
👤 *Ваш профиль:* Быстрый доступ через /me
🌎 *Используйте где угодно* с помощью @okimi_chan_bot {имя пользователя}, вы можете использовать бота в личных чатах, и групах где его нет


Для полного списка команд и дополнительной информации используйте /help

*🛠️ Разработчики:*
@HELLPER7788 • @ByteMe6 • @ArchiPank
`;

  bot.sendMessage(msg.chat.id, startMsg, { parse_mode: "Markdown" });
}